#### OpenTofu Plan `success`

<details><summary>Show Plan</summary>

```

tofu
data.github_user.test-opentofu-mageos: Reading...
github_team.teams["async-events"]: Refreshing state... [id=11884010]
github_team.teams["distribution"]: Refreshing state... [id=11884012]
github_team.teams["tech-lead"]: Refreshing state... [id=11884044]
github_membership.users["davidtab"]: Refreshing state... [id=test-opentofu-mageos:davidtab]
github_team.teams["content"]: Refreshing state... [id=11884013]
github_team.teams["infrastructure"]: Refreshing state... [id=11884045]
github_team.teams["continuous-integration"]: Refreshing state... [id=11884011]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp]
github_repository.repositories["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory]
data.github_user.test-opentofu-mageos: Read complete after 2s [id=194426221]
github_repository.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception]
github_repository.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework]
github_repository.repositories["devdocs"]: Refreshing state... [id=devdocs]
github_repository.repositories["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["mageos-async-events"]: Refreshing state... [id=mageos-async-events]
github_repository.repositories["magento-gitpod"]: Refreshing state... [id=magento-gitpod]
github_repository.repositories["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db]
github_repository.repositories["mageos-composer"]: Refreshing state... [id=mageos-composer]
github_repository.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache]
github_repository.repositories["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events]
github_repository.repositories["meta"]: Refreshing state... [id=meta]
github_repository.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["github-actions"]: Refreshing state... [id=github-actions]
github_repository.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader]
github_repository.repositories["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard]
github_repository.repositories["opentofu"]: Refreshing state... [id=opentofu]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui]
github_repository.repositories["devdocs-website"]: Refreshing state... [id=devdocs-website]
github_repository.repositories["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure]
github_repository.mirrors["mirror-commerce-admin.en"]: Refreshing state... [id=mirror-commerce-admin.en]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-commerce-operations.en"]: Refreshing state... [id=mirror-commerce-operations.en]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.mirrors["mirror-magento-zend-pdf"]: Refreshing state... [id=mirror-magento-zend-pdf]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.mirrors["mirror-magento-zend-exception"]: Refreshing state... [id=mirror-magento-zend-exception]
github_repository.mirrors["mirror-quality-patches"]: Refreshing state... [id=mirror-quality-patches]
github_repository.mirrors["mirror-magento-zend-loader"]: Refreshing state... [id=mirror-magento-zend-loader]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-magento-zend-cache"]: Refreshing state... [id=mirror-magento-zend-cache]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-data-migration-tool"]: Refreshing state... [id=mirror-data-migration-tool]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-PHPCompatibilityFork"]: Refreshing state... [id=mirror-PHPCompatibilityFork]
github_repository.mirrors["mirror-magento-coding-standard"]: Refreshing state... [id=mirror-magento-coding-standard]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-magento-zend-db"]: Refreshing state... [id=mirror-magento-zend-db]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-magento-zend-log"]: Refreshing state... [id=mirror-magento-zend-log]
github_repository.mirrors["mirror-magento-cloud-patches"]: Refreshing state... [id=mirror-magento-cloud-patches]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-magento-zend-memory"]: Refreshing state... [id=mirror-magento-zend-memory]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento2-functional-testing-framework"]: Refreshing state... [id=mirror-magento2-functional-testing-framework]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_team_membership.members["davidtabat_tech-lead"]: Refreshing state... [id=11884044:davidtabat]
github_team_membership.members["davidtabat_infrastructure"]: Refreshing state... [id=11884045:davidtabat]
github_team_membership.members["davidtabat_distribution"]: Refreshing state... [id=11884012:davidtabat]
github_team_membership.members["davidtabat_content"]: Refreshing state... [id=11884013:davidtabat]
github_team_membership.members["davidtab_async-events"]: Refreshing state... [id=11884010:davidtab]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=11884045:infrastructure]
github_team_repository.teams["mageos-async-events_async-events"]: Refreshing state... [id=11884010:mageos-async-events]
github_team_repository.teams["opentofu_infrastructure"]: Refreshing state... [id=11884045:opentofu]
github_team_repository.teams["github-actions_infrastructure"]: Refreshing state... [id=11884045:github-actions]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=11884012:mageos-composer-root-update-plugin]
github_team_repository.teams["mageos-async-events-admin-ui_distribution"]: Refreshing state... [id=11884012:mageos-async-events-admin-ui]
github_team_repository.teams["mageos-magento-zend-loader_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-loader]
github_team_repository.teams["mageos-common-async-events_async-events"]: Refreshing state... [id=11884010:mageos-common-async-events]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=11884012:mageos-magento2-page-builder]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=11884012:mageos-inventory]
github_team_repository.teams["mageos-async-events-azure_async-events"]: Refreshing state... [id=11884010:mageos-async-events-azure]
github_team_repository.teams["mageos-magento-zend-pdf_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-pdf]
github_team_repository.teams["mageos-magento-zend-memory_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-memory]
github_team_repository.teams["mageos-async-events-admin-ui_async-events"]: Refreshing state... [id=11884010:mageos-async-events-admin-ui]
github_team_repository.teams["devdocs-website_content"]: Refreshing state... [id=11884013:devdocs-website]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=11884012:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-composer_distribution"]: Refreshing state... [id=11884012:mageos-composer]
github_team_repository.teams["mageos-magento-zend-exception_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-exception]
github_team_repository.teams["mageos-common-async-events_distribution"]: Refreshing state... [id=11884012:mageos-common-async-events]
github_team_repository.teams["meta_infrastructure"]: Refreshing state... [id=11884045:meta]
github_team_repository.teams["meta_distribution"]: Refreshing state... [id=11884012:meta]
github_team_repository.teams["devdocs_infrastructure"]: Refreshing state... [id=11884045:devdocs]
github_team_repository.teams["mageos-magento-zend-cache_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-cache]
github_team_repository.teams["mageos-async-events-sinks_distribution"]: Refreshing state... [id=11884012:mageos-async-events-sinks]
github_team_repository.teams["mageos-magento-zend-log_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-log]
github_team_repository.teams["mageos-async-events-aws_async-events"]: Refreshing state... [id=11884010:mageos-async-events-aws]
github_team_repository.teams["mageos-async-events-aws_distribution"]: Refreshing state... [id=11884012:mageos-async-events-aws]
github_team_repository.teams["meta_content"]: Refreshing state... [id=11884013:meta]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=11884012:mageos-magento-composer-installer]
github_team_repository.teams["magento-gitpod_infrastructure"]: Refreshing state... [id=11884045:magento-gitpod]
github_team_repository.teams["mageos-async-events-gcp_async-events"]: Refreshing state... [id=11884010:mageos-async-events-gcp]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=11884013:mage-os-website]
github_team_repository.teams["devdocs-website_infrastructure"]: Refreshing state... [id=11884045:devdocs-website]
github_team_repository.teams["mageos-async-events-gcp_distribution"]: Refreshing state... [id=11884012:mageos-async-events-gcp]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=11884045:namespace]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=11884012:mageos-magento2-sample-data]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=11884045:generate-mirror-repo-js]
github_team_repository.teams["mageos-magento-zend-db_distribution"]: Refreshing state... [id=11884012:mageos-magento-zend-db]
github_team_repository.teams["mageos-magento2-functional-testing-framework_distribution"]: Refreshing state... [id=11884012:mageos-magento2-functional-testing-framework]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=11884012:mageos-security-package]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=11884012:mageos-magento2]
github_team_repository.teams["mageos-async-events-sinks_async-events"]: Refreshing state... [id=11884010:mageos-async-events-sinks]
github_team_repository.teams["mageos-PHPCompatibilityFork_distribution"]: Refreshing state... [id=11884012:mageos-PHPCompatibilityFork]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=11884012:mageos-commerce-data-export]
github_team_repository.teams["mageos-magento-coding-standard_distribution"]: Refreshing state... [id=11884012:mageos-magento-coding-standard]
github_team_repository.teams["mageos-async-events-azure_distribution"]: Refreshing state... [id=11884012:mageos-async-events-azure]
github_team_repository.teams["meta_tech-lead"]: Refreshing state... [id=11884044:meta]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=11884012:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-async-events_distribution"]: Refreshing state... [id=11884012:mageos-async-events]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=11884012:mageos-inventory-composer-installer]
github_team_repository.teams["meta_continuous-integration"]: Refreshing state... [id=11884011:meta]
github_team_repository.teams["devdocs_content"]: Refreshing state... [id=11884013:devdocs]
github_team_repository.teams["dev-env-gitpod_infrastructure"]: Refreshing state... [id=11884045:dev-env-gitpod]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["magento-gitpod"]: Refreshing state... [id=magento-gitpod/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events/CODEOWNERS]
github_repository_file.codeowners["github-actions"]: Refreshing state... [id=github-actions/CODEOWNERS]
github_repository_file.codeowners["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-composer"]: Refreshing state... [id=mageos-composer/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/CODEOWNERS]
github_repository_file.codeowners["meta"]: Refreshing state... [id=meta/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/CODEOWNERS]
github_repository_file.codeowners["devdocs"]: Refreshing state... [id=devdocs/CODEOWNERS]
github_repository_file.codeowners["devdocs-website"]: Refreshing state... [id=devdocs-website/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-async-events"]: Refreshing state... [id=mageos-async-events/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/CODEOWNERS]
github_repository_file.codeowners["opentofu"]: Refreshing state... [id=opentofu/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.sansec_ecomscan_workflow["meta"]: Refreshing state... [id=meta/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-sinks"]: Refreshing state... [id=mageos-async-events-sinks/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["infrastructure"]: Refreshing state... [id=infrastructure/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["namespace"]: Refreshing state... [id=namespace/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-common-async-events"]: Refreshing state... [id=mageos-common-async-events/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-admin-ui"]: Refreshing state... [id=mageos-async-events-admin-ui/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["devdocs"]: Refreshing state... [id=devdocs/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-gcp"]: Refreshing state... [id=mageos-async-events-gcp/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-security-package"]: Refreshing state... [id=mageos-security-package/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-inventory"]: Refreshing state... [id=mageos-inventory/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events"]: Refreshing state... [id=mageos-async-events/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-azure"]: Refreshing state... [id=mageos-async-events-azure/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["magento-gitpod"]: Refreshing state... [id=magento-gitpod/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer"]: Refreshing state... [id=mageos-composer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["opentofu"]: Refreshing state... [id=opentofu/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["github-actions"]: Refreshing state... [id=github-actions/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-async-events-aws"]: Refreshing state... [id=mageos-async-events-aws/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento2"]: Refreshing state... [id=mageos-magento2/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["dev-env-gitpod"]: Refreshing state... [id=dev-env-gitpod/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/.github/workflows/sansec-ecomscan.yml]
github_repository_file.sansec_ecomscan_workflow["devdocs-website"]: Refreshing state... [id=devdocs-website/.github/workflows/sansec-ecomscan.yml]
github_team_repository.tech-lead["mageos-async-events-sinks"]: Refreshing state... [id=11884044:mageos-async-events-sinks]
github_team_repository.tech-lead["mageos-async-events"]: Refreshing state... [id=11884044:mageos-async-events]
github_team_repository.tech-lead["dev-env-gitpod"]: Refreshing state... [id=11884044:dev-env-gitpod]
github_team_repository.tech-lead["mageos-magento-zend-pdf"]: Refreshing state... [id=11884044:mageos-magento-zend-pdf]
github_team_repository.tech-lead["mageos-magento-zend-memory"]: Refreshing state... [id=11884044:mageos-magento-zend-memory]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=11884044:mageos-magento2]
github_team_repository.tech-lead["github-actions"]: Refreshing state... [id=11884044:github-actions]
github_team_repository.tech-lead["opentofu"]: Refreshing state... [id=11884044:opentofu]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=11884044:mageos-security-package]
github_team_repository.tech-lead["mageos-async-events-aws"]: Refreshing state... [id=11884044:mageos-async-events-aws]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=11884044:mageos-adobe-stock-integration]
github_team_repository.tech-lead["mageos-composer"]: Refreshing state... [id=11884044:mageos-composer]
github_team_repository.tech-lead["mageos-PHPCompatibilityFork"]: Refreshing state... [id=11884044:mageos-PHPCompatibilityFork]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=11884044:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=11884044:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["mageos-common-async-events"]: Refreshing state... [id=11884044:mageos-common-async-events]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=11884044:mageos-inventory]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=11884044:namespace]
github_team_repository.tech-lead["devdocs"]: Refreshing state... [id=11884044:devdocs]
github_team_repository.tech-lead["mageos-magento-coding-standard"]: Refreshing state... [id=11884044:mageos-magento-coding-standard]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=11884044:infrastructure]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=11884044:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-magento-zend-loader"]: Refreshing state... [id=11884044:mageos-magento-zend-loader]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=11884044:mageos-commerce-data-export]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=11884044:mageos-magento2-page-builder]
github_team_repository.tech-lead["devdocs-website"]: Refreshing state... [id=11884044:devdocs-website]
github_team_repository.tech-lead["meta"]: Refreshing state... [id=11884044:meta]
github_team_repository.tech-lead["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=11884044:mageos-magento2-functional-testing-framework]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=11884044:mageos-magento2-sample-data]
github_team_repository.tech-lead["mageos-async-events-gcp"]: Refreshing state... [id=11884044:mageos-async-events-gcp]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=11884044:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-async-events-azure"]: Refreshing state... [id=11884044:mageos-async-events-azure]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=11884044:mage-os-website]
github_team_repository.tech-lead["mageos-magento-zend-db"]: Refreshing state... [id=11884044:mageos-magento-zend-db]
github_team_repository.tech-lead["mageos-magento-zend-log"]: Refreshing state... [id=11884044:mageos-magento-zend-log]
github_team_repository.tech-lead["mageos-magento-zend-cache"]: Refreshing state... [id=11884044:mageos-magento-zend-cache]
github_team_repository.tech-lead["mageos-async-events-admin-ui"]: Refreshing state... [id=11884044:mageos-async-events-admin-ui]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=11884044:generate-mirror-repo-js]
github_team_repository.tech-lead["magento-gitpod"]: Refreshing state... [id=11884044:magento-gitpod]
github_team_repository.tech-lead["mageos-magento-zend-exception"]: Refreshing state... [id=11884044:mageos-magento-zend-exception]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDONoPPHM4De404]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDONoPMpc4De405]
github_branch_protection.repositories["mageos-magento-zend-exception"]: Refreshing state... [id=BPR_kwDONoPI3s4De41K]
github_branch_protection.repositories["mageos-common-async-events"]: Refreshing state... [id=BPR_kwDONoPOLM4De41D]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDONoPNvc4De40o]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDONoPOks4De41Q]
github_branch_protection.repositories["mageos-magento-zend-memory"]: Refreshing state... [id=BPR_kwDONoPJTM4De40w]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDONoPM4s4De41F]
github_branch_protection.repositories["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=BPR_kwDONoPMVc4De40r]
github_branch_protection.repositories["opentofu"]: Refreshing state... [id=BPR_kwDONoPKC84De41N]
github_branch_protection.repositories["mageos-magento-zend-loader"]: Refreshing state... [id=BPR_kwDONoPHXs4De40t]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDONoPH7c4De40x]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDONoPIws4De40k]
github_branch_protection.repositories["mageos-async-events-sinks"]: Refreshing state... [id=BPR_kwDONoPLJc4De409]
github_branch_protection.repositories["github-actions"]: Refreshing state... [id=BPR_kwDONoPOaM4De402]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDONoPH3s4De40-]
github_branch_protection.repositories["devdocs-website"]: Refreshing state... [id=BPR_kwDONoPH884De41L]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDONoPOVc4De40p]
github_branch_protection.repositories["mageos-magento-zend-db"]: Refreshing state... [id=BPR_kwDONoPJOM4De403]
github_branch_protection.repositories["mageos-composer"]: Refreshing state... [id=BPR_kwDONoPKsc4De41O]
github_branch_protection.repositories["magento-gitpod"]: Refreshing state... [id=BPR_kwDONoPNJs4De406]
github_branch_protection.repositories["mageos-magento-zend-cache"]: Refreshing state... [id=BPR_kwDONoPN4M4De40v]
github_branch_protection.repositories["meta"]: Refreshing state... [id=BPR_kwDONoPIus4De40n]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDONoPM_c4De40u]
github_branch_protection.repositories["mageos-magento-zend-log"]: Refreshing state... [id=BPR_kwDONoPH484De41J]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDONoPN6c4De401]
github_branch_protection.repositories["mageos-magento-zend-pdf"]: Refreshing state... [id=BPR_kwDONoPPis4De40s]
github_branch_protection.repositories["dev-env-gitpod"]: Refreshing state... [id=BPR_kwDONoPKAc4De408]
github_branch_protection.repositories["mageos-PHPCompatibilityFork"]: Refreshing state... [id=BPR_kwDONoPMY84De41R]
github_branch_protection.repositories["mageos-async-events-admin-ui"]: Refreshing state... [id=BPR_kwDONoPIms4De407]
github_branch_protection.repositories["devdocs"]: Refreshing state... [id=BPR_kwDONoPJ3M4De40_]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDONoPOIc4De40m]
github_branch_protection.repositories["mageos-magento-coding-standard"]: Refreshing state... [id=BPR_kwDONoPIM84De40l]
github_branch_protection.repositories["mageos-async-events"]: Refreshing state... [id=BPR_kwDONoPOOc4De400]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDONoPPns4De40y]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDONoPHic4De41M]
github_repository_file.merge-upstream-changes["mageos-magento-zend-cache"]: Refreshing state... [id=mageos-magento-zend-cache/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-coding-standard"]: Refreshing state... [id=mageos-magento-coding-standard/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-functional-testing-framework"]: Refreshing state... [id=mageos-magento2-functional-testing-framework/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-db"]: Refreshing state... [id=mageos-magento-zend-db/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-loader"]: Refreshing state... [id=mageos-magento-zend-loader/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-exception"]: Refreshing state... [id=mageos-magento-zend-exception/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-PHPCompatibilityFork"]: Refreshing state... [id=mageos-PHPCompatibilityFork/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2"]: Refreshing state... [id=mageos-magento2/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-security-package"]: Refreshing state... [id=mageos-security-package/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-pdf"]: Refreshing state... [id=mageos-magento-zend-pdf/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-log"]: Refreshing state... [id=mageos-magento-zend-log/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-inventory"]: Refreshing state... [id=mageos-inventory/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-composer"]: Refreshing state... [id=mageos-composer/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-magento-zend-memory"]: Refreshing state... [id=mageos-magento-zend-memory/.github/workflows/merge-upstream-changes.yml]
github_repository_file.merge-upstream-changes["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/.github/workflows/merge-upstream-changes.yml]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

OpenTofu will perform the following actions:

  # github_branch_default.repositories["mageos-async-events"] will be created
  + resource "github_branch_default" "repositories" {
      + branch     = "4.x"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "mageos-async-events"
    }

  # github_branch_protection.mirrors["mirror-PHPCompatibilityFork"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPLPw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-adobe-ims"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPIyw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-adobe-stock-integration"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPKbw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-commerce-admin.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPMag"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-commerce-data-export"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPKLQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-commerce-operations.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJqg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-composer"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJ5w"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPOnw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-composer-root-update-plugin"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPK5w"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-data-migration-tool"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJ_A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-devdocs"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJWA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-inventory"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPPfw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-inventory-composer-installer"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPHbA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-cloud-patches"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPKkQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-coding-standard"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJjA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-composer-installer"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPLyQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-cache"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPMYg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-db"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPMDw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-exception"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPPaA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-loader"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPL2Q"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-log"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPJ1w"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-memory"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPPQQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento-zend-pdf"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPMKg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento2"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPHdQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento2-functional-testing-framework"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPL5g"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento2-page-builder"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPLSA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-magento2-sample-data"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPMvg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPM0A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-page-builder-types"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPI_g"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-quality-patches"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPLTg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-security-package"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPHeA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.mirrors["mirror-zf1"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = true
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPLLg"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.repositories["dev-env-gitpod"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPKAc4De408"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["devdocs"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPJ3M4De40_"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXt",
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["devdocs-website"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPH884De41L"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXt",
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["generate-mirror-repo-js"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPMpc4De405"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["github-actions"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOaM4De402"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["infrastructure"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPIws4De40k"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["magento-gitpod"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPNJs4De406"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-PHPCompatibilityFork"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPMY84De41R"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-adobe-stock-integration"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPM4s4De41F"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-async-events"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOOc4De400"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXq",
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-async-events-admin-ui"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPIms4De407"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXq",
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-async-events-aws"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPHrQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.repositories["mageos-async-events-azure"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPNFw"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.repositories["mageos-async-events-gcp"] will be created
  + resource "github_branch_protection" "repositories" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = "R_kgDONoPOiQ"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }

      + restrict_pushes {
          + blocks_creations = true
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_branch_protection.repositories["mageos-async-events-sinks"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPLJc4De409"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXq",
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-commerce-data-export"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPPns4De40y"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-common-async-events"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOLM4De41D"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXq",
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-composer"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPKsc4De41O"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOVc4De40p"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-composer-root-update-plugin"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPNvc4De40o"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-inventory"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPHic4De41M"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-inventory-composer-installer"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPM_c4De40u"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-coding-standard"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPIM84De40l"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-composer-installer"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPPHM4De404"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-cache"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPN4M4De40v"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-db"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPJOM4De403"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-exception"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPI3s4De41K"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-loader"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPHXs4De40t"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-log"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPH484De41J"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-memory"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPJTM4De40w"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento-zend-pdf"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPPis4De40s"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento2"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOIc4De40m"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento2-functional-testing-framework"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPMVc4De40r"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento2-page-builder"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPH7c4De40x"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-magento2-sample-data"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPOks4De41Q"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["mageos-security-package"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPH3s4De40-"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXs",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["meta"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPIus4De40n"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVXr",
              + "T_kwDOC5a1bc4AtVXs",
              + "T_kwDOC5a1bc4AtVXt",
              + "T_kwDOC5a1bc4AtVYM",
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["namespace"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPN6c4De401"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories["opentofu"] will be updated in-place
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDONoPKC84De41N"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismissal_restrictions          = [
              + "T_kwDOC5a1bc4AtVYM",
            ]
            # (6 unchanged attributes hidden)
        }

      ~ restrict_pushes {
          ~ push_allowances  = [
              + "T_kwDOC5a1bc4AtVYN",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repositories-release-please["github-actions"] will be created
  + resource "github_branch_protection" "repositories-release-please" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + force_push_bypassers            = [
          + "O_kgDOC5a1bQ",
        ]
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "release-please--branches--main--components--github-actions"
      + repository_id                   = "R_kgDONoPOaA"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + restrict_pushes {
          + blocks_creations = false
          + push_allowances  = [
              + "O_kgDOC5a1bQ",
            ]
        }
    }

  # github_membership.users["davidtab"] will be destroyed
  # (because key ["davidtab"] is not in for_each map)
  - resource "github_membership" "users" {
      - downgrade_on_destroy = false -> null
      - etag                 = "W/\"b3a263e778cc174f76396ada0a63902e2ef3dac5e027558a1dcfb9ac4a4c8138\"" -> null
      - id                   = "test-opentofu-mageos:davidtab" -> null
      - role                 = "member" -> null
      - username             = "davidtab" -> null
    }

  # github_membership.users["davidtabat"] will be created
  + resource "github_membership" "users" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "davidtabat"
    }

  # github_membership.users["test-opentofu-mageos"] will be created
  + resource "github_membership" "users" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "admin"
      + username             = "test-opentofu-mageos"
    }

  # github_repository.mirrors["mirror-PHPCompatibilityFork"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-PHPCompatibilityFork"
        name                        = "mirror-PHPCompatibilityFork"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-adobe-ims"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-adobe-ims"
        name                        = "mirror-adobe-ims"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-adobe-stock-integration"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-adobe-stock-integration"
        name                        = "mirror-adobe-stock-integration"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-commerce-admin.en"
        name                        = "mirror-commerce-admin.en"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-commerce-data-export"
        name                        = "mirror-commerce-data-export"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-commerce-operations.en"
        name                        = "mirror-commerce-operations.en"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-composer"
        name                        = "mirror-composer"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-composer-dependency-version-audit-plugin"
        name                        = "mirror-composer-dependency-version-audit-plugin"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-composer-root-update-plugin"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-composer-root-update-plugin"
        name                        = "mirror-composer-root-update-plugin"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-data-migration-tool"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-data-migration-tool"
        name                        = "mirror-data-migration-tool"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-devdocs"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-devdocs"
        name                        = "mirror-devdocs"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-inventory"
        name                        = "mirror-inventory"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-inventory-composer-installer"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-inventory-composer-installer"
        name                        = "mirror-inventory-composer-installer"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-cloud-patches"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-cloud-patches"
        name                        = "mirror-magento-cloud-patches"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-coding-standard"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-coding-standard"
        name                        = "mirror-magento-coding-standard"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-composer-installer"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-composer-installer"
        name                        = "mirror-magento-composer-installer"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-cache"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-cache"
        name                        = "mirror-magento-zend-cache"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-db"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-db"
        name                        = "mirror-magento-zend-db"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-exception"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-exception"
        name                        = "mirror-magento-zend-exception"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-loader"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-loader"
        name                        = "mirror-magento-zend-loader"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-log"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-log"
        name                        = "mirror-magento-zend-log"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-memory"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-memory"
        name                        = "mirror-magento-zend-memory"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento-zend-pdf"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento-zend-pdf"
        name                        = "mirror-magento-zend-pdf"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento2"
        name                        = "mirror-magento2"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-functional-testing-framework"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento2-functional-testing-framework"
        name                        = "mirror-magento2-functional-testing-framework"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-page-builder"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento2-page-builder"
        name                        = "mirror-magento2-page-builder"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-magento2-sample-data"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-magento2-sample-data"
        name                        = "mirror-magento2-sample-data"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-module-configurable-sample-data-venia"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-module-configurable-sample-data-venia"
        name                        = "mirror-module-configurable-sample-data-venia"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-page-builder-types"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-page-builder-types"
        name                        = "mirror-page-builder-types"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-quality-patches"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-quality-patches"
        name                        = "mirror-quality-patches"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-security-package"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-security-package"
        name                        = "mirror-security-package"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.mirrors["mirror-zf1"] will be updated in-place
  ~ resource "github_repository" "mirrors" {
        id                          = "mirror-zf1"
        name                        = "mirror-zf1"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["dev-env-gitpod"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "dev-env-gitpod"
        name                        = "dev-env-gitpod"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["devdocs"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "devdocs"
        name                        = "devdocs"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["devdocs-website"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "devdocs-website"
        name                        = "devdocs-website"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "generate-mirror-repo-js"
        name                        = "generate-mirror-repo-js"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["github-actions"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "github-actions"
        name                        = "github-actions"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["infrastructure"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "infrastructure"
        name                        = "infrastructure"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["magento-gitpod"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "magento-gitpod"
        name                        = "magento-gitpod"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-PHPCompatibilityFork"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-PHPCompatibilityFork"
        name                        = "mageos-PHPCompatibilityFork"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-adobe-stock-integration"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-adobe-stock-integration"
        name                        = "mageos-adobe-stock-integration"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events"
        name                        = "mageos-async-events"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events-admin-ui"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events-admin-ui"
        name                        = "mageos-async-events-admin-ui"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events-aws"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events-aws"
        name                        = "mageos-async-events-aws"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events-azure"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events-azure"
        name                        = "mageos-async-events-azure"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events-gcp"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events-gcp"
        name                        = "mageos-async-events-gcp"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-async-events-sinks"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-async-events-sinks"
        name                        = "mageos-async-events-sinks"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-commerce-data-export"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-commerce-data-export"
        name                        = "mageos-commerce-data-export"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-common-async-events"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-common-async-events"
        name                        = "mageos-common-async-events"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-composer"
        name                        = "mageos-composer"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-dependency-version-audit-plugin"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-composer-dependency-version-audit-plugin"
        name                        = "mageos-composer-dependency-version-audit-plugin"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-composer-root-update-plugin"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-composer-root-update-plugin"
        name                        = "mageos-composer-root-update-plugin"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-inventory"
        name                        = "mageos-inventory"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-inventory-composer-installer"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-inventory-composer-installer"
        name                        = "mageos-inventory-composer-installer"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-coding-standard"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-coding-standard"
        name                        = "mageos-magento-coding-standard"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-composer-installer"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-composer-installer"
        name                        = "mageos-magento-composer-installer"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-cache"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-cache"
        name                        = "mageos-magento-zend-cache"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-db"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-db"
        name                        = "mageos-magento-zend-db"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-exception"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-exception"
        name                        = "mageos-magento-zend-exception"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-loader"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-loader"
        name                        = "mageos-magento-zend-loader"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-log"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-log"
        name                        = "mageos-magento-zend-log"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-memory"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-memory"
        name                        = "mageos-magento-zend-memory"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento-zend-pdf"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento-zend-pdf"
        name                        = "mageos-magento-zend-pdf"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento2"
        name                        = "mageos-magento2"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-functional-testing-framework"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento2-functional-testing-framework"
        name                        = "mageos-magento2-functional-testing-framework"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-page-builder"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento2-page-builder"
        name                        = "mageos-magento2-page-builder"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-magento2-sample-data"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-magento2-sample-data"
        name                        = "mageos-magento2-sample-data"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["mageos-security-package"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "mageos-security-package"
        name                        = "mageos-security-package"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["meta"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "meta"
        name                        = "meta"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["namespace"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "namespace"
        name                        = "namespace"
      - vulnerability_alerts        = true -> null
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repositories["opentofu"] will be updated in-place
  ~ resource "github_repository" "repositories" {
        id                          = "opentofu"
        name                        = "opentofu"
      - vulnerability_alerts        = true -> null
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.codeowners["mage-os-website"] will be created
  + resource "github_repository_file" "codeowners" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_author                = "test-opentofu-mageos"
      + commit_email                 = "info@mage-os.org"
      + commit_message               = "Managed by OpenTofu"
      + commit_sha                   = (known after apply)
      + content                      = "* @test-opentofu-mageos/content"
      + file                         = "CODEOWNERS"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "mage-os-website"
      + sha                          = (known after apply)
    }

  # github_repository_file.codeowners["opentofu"] will be updated in-place
  ~ resource "github_repository_file" "codeowners" {
      ~ content             = "* @Mage-OS/infrastructure" -> "* @test-opentofu-mageos/infrastructure"
        id                  = "opentofu/CODEOWNERS"
        # (10 unchanged attributes hidden)
    }

  # github_team_membership.members["davidtab_async-events"] will be destroyed
  # (because key ["davidtab_async-events"] is not in for_each map)
  - resource "github_team_membership" "members" {
      - etag     = "W/\"1d8c407fe8a840b1ad0463feb8b832e4dde7d683d6396f0da9b691f9265f50ad\"" -> null
      - id       = "11884010:davidtab" -> null
      - role     = "member" -> null
      - team_id  = "11884010" -> null
      - username = "davidtab" -> null
    }

  # github_team_membership.members["davidtabat_async-events"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "11884010"
      + username = "davidtabat"
    }

  # github_team_membership.members["davidtabat_content"] will be updated in-place
  ~ resource "github_team_membership" "members" {
        id       = "11884013:davidtabat"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["davidtabat_distribution"] will be updated in-place
  ~ resource "github_team_membership" "members" {
        id       = "11884012:davidtabat"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["davidtabat_infrastructure"] will be updated in-place
  ~ resource "github_team_membership" "members" {
        id       = "11884045:davidtabat"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["davidtabat_tech-lead"] will be updated in-place
  ~ resource "github_team_membership" "members" {
        id       = "11884044:davidtabat"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["test-opentofu-mageos_continuous-integration"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "11884011"
      + username = "test-opentofu-mageos"
    }

  # github_team_repository.tech-lead["meta"] will be updated in-place
  ~ resource "github_team_repository" "tech-lead" {
        id         = "11884044:meta"
      ~ permission = "push" -> "maintain"
        # (3 unchanged attributes hidden)
    }

Plan: 42 to add, 113 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

Issuer: @davidtabat, Action: https://github.com/test-opentofu-mageos/opentofu/actions/runs/12718790711